---
type: ReferencePlane
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# ReferencePlane

`Autodesk.Revit.DB.ReferencePlane` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Flip | — | `public void Flip ()` |
| Method | GetPlane | 2016 | `public Plane GetPlane ()` |
| Method | GetReference | 2016 | `public Reference GetReference ()` |
| Property | BubbleEnd | — | `public XYZ BubbleEnd { get ; set ; }` |
| Property | Direction | — | `public XYZ Direction { get ; set ; }` |
| Property | FreeEnd | — | `public XYZ FreeEnd { get ; set ; }` |
| Property | Name | — | `public string Name { get ; set ; }` |
| Property | Normal | — | `public XYZ Normal { get ; }` |
| Property | Parameter | — | `` |